Revit 2027 API
BuildingOperatingYearSchedule.GetScheduleForDay Method
 Gets the BuildingOperatingDaySchedule for this day of the year.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BuildingOperatingDaySchedule GetScheduleForDay(
	DateTime day
)
Public Function GetScheduleForDay (
	day As DateTime
) As BuildingOperatingDaySchedule
public:
BuildingOperatingDaySchedule^ GetScheduleForDay(
	DateTime day
)
member GetScheduleForDay :
        day : DateTime -> BuildingOperatingDaySchedule
Parameters
day DateTime
 The day of the year. The value must be in 2023 (the template year) and have the time zone set to gmt/utc. Time values will be ignored.
Return Value
BuildingOperatingDaySchedule
 The schedule used on that day.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  day must be in the year 2023.
Remarks
 The day argument must be in 2023 to match the template year in the user interface calendar: it has 365 days and starts on a Sunday.
See Also
Reference
BuildingOperatingYearSchedule Class
Autodesk.Revit.DB.Analysis Namespace